Revit 2027 API
DWFImageQuality Enumeration
An enumerated type listing possible image quality for DWF Export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DWFImageQuality
Public Enumeration DWFImageQuality
public enum class DWFImageQuality
type DWFImageQuality
Members
Member name | Value | Description
Default | 10
High | 13
Low | 11
Medium | 12
See Also
Reference
Autodesk.Revit.DB Namespace